SunCity/src/Documents/РасчетПремийПоЛичнымПродажам/РасчетПремийПоЛичнымПродажам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасчетПремийПоЛичнымПродажам</name>
  <registerRecords>AccumulationRegister.ПремииПоЛичнымПродажам</registerRecords>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасчетаДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасчетаДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаПремий</name>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Магазин</name>
      <type>
        <types>CatalogRef.Магазины</types>
      </type>
    </attributes>
    <attributes>
      <name>ПравилоРасчетаПремий</name>
      <type>
        <types>CatalogRef.ПравилаРасчетаПремий</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПродаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SunCity/src/Documents/РасчетПремийПоЛичнымПродажам/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Инициализирует таблицы значений, содержащие данные документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.АктОРасхожденияхПриПриемкеТоваров - документ для инициализации данных.
//  ДополнительныеСвойства - Структура - структура дополнительных свойств.
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РасчетПремийПоЛичнымПродажамТаблицаПремий.Ссылка.Дата КАК ПЕРИОД,
		|	РасчетПремийПоЛичнымПродажамТаблицаПремий.НомерСтроки,
		|	РасчетПремийПоЛичнымПродажамТаблицаПремий.Ссылка.Магазин КАК МагазинРасчетаПремий,
		|	РасчетПремийПоЛичнымПродажамТаблицаПремий.Магазин КАК МагазинПродаж,
		|	РасчетПремийПоЛичнымПродажамТаблицаПремий.ФизЛицо КАК Продавец,
		|	РасчетПремийПоЛичнымПродажамТаблицаПремий.ПравилоРасчетаПремий,
		|	РасчетПремийПоЛичнымПродажамТаблицаПремий.Ссылка.ПериодРасчетаДатаНачала КАК ПериодРасчетаДатаНачала,
		|	РасчетПремийПоЛичнымПродажамТаблицаПремий.Ссылка.ПериодРасчетаДатаОкончания КАК ПериодРасчетаДатаОкончания,
		|	РасчетПремийПоЛичнымПродажамТаблицаПремий.Количество КАК Количество,
		|	РасчетПремийПоЛичнымПродажамТаблицаПремий.СуммаПродаж КАК СуммаПродаж,
		|	РасчетПремийПоЛичнымПродажамТаблицаПремий.СуммаПремии
		|ИЗ
		|	Документ.РасчетПремийПоЛичнымПродажам.ТаблицаПремий КАК РасчетПремийПоЛичнымПродажамТаблицаПремий
		|ГДЕ
		|	РасчетПремийПоЛичнымПродажамТаблицаПремий.Ссылка = &Ссылка
		|";

	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаНачисленныхПремийПоЛичнымПродажам", ТаблицаРезультат);
	
КонецПроцедуры

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Магазин)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецЕсли
